Repository: e-part/open-community-app
Catalog: po/*.po
Languages: he_il

source: <h2>Terms of Use (&quot;Terms&quot;) </h2><p><span>Please read these Terms of Use (&quot;Terms&quot;, &quot;Terms of Use&quot;) carefully before using the https://beta.epart.co.il/website (the &quot;Service&quot;) operated by AVSHA, Inc. (&quot;us&quot;, &quot;we&quot;, or &quot;our&quot;). </span></p><p ><span>Your access to and use of the Service is conditioned on your acceptance of and compliance with these Terms. These Terms apply to all visitors, users and others who access or use the Service.</span></p><p ><span>By accessing or using the Service you agree to be bound by these Terms. If you disagree with any part of the terms then you may not access the Service. </span></p><p><span ></span></p><h2>Termination</span><span>&nbsp;</h2><p ><span>We may terminate or suspend access to our Service immediately, without prior notice or liability, for any reason whatsoever, including without limitation if you breach the Terms.</span></p><p ><span>All provisions of the Terms which by their nature should survive termination shall survive termination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and limitations of liability.</span></p><h2 >Links To Other Web Sites</h2><p ><span>Our Service may contain links to thirdparty web sites or services that are not owned or controlled by ePart.</span></p><p ><span>ePart has no control over, and assumes no responsibility for, the content, privacy policies, or practices of any third party web sites or services. You further acknowledge and agree that My Company, Inc. (change this) shall not be responsible or liable, directly or indirectly, for any damage or loss caused or alleged to be caused by or in connection with use of or reliance on any such content, goods or services available on or through any such web sites or services.</span></p><p ><span>&nbsp;We strongly advise you to read the terms and conditions and privacy policies of any thirdparty web sites or services that you visit. </span></p><h2 >Governing Law</h2><p ><span>These Terms shall be governed and construed in accordance with the laws of Israel, without regard to its conflict of law provisions.</span></p><p ><span>Our failure to enforce any right or provision of these Terms will not be considered a waiver of those rights. If any provision of these Terms is held to be invalid or unenforceable by a court, the remaining provisions of these Terms will remain in effect. These Terms constitute the entire agreement between us regarding our Service, and supersede and replace any prior agreements we might have between us regarding the Service.</span></p><h2>Changes </h2><p ><span>We reserve the right, at our sole discretion, to modify or replace these Terms at any time. If a revision is material we will try to provide at least 30 &nbsp;days notice prior to any new terms taking effect. What constitutes a material change will be determined at our sole discretion.</span></p><p ><span>By continuing to access or use our Service after those revisions become effective, you agree to be bound by the revised terms. If you do not agree to the new terms, please stop using the Service. </span></p><h2 >Contact Us</span><span>&nbsp;</h2><p ><span>If you have any questions about these Terms, please contact us.</span></p>
he_il: <p class="highlighted"> ברוך הבא ל – ePart! אנו שמחים על הצטרפותך כמשתתף במיזם שלנו. אנו ממליצים כי תקרא את תנאי השימוש להלן, היות וההרשמה לאתר וההשתתפות במיזם מהווים הסכמה להוראות אלו. </p> <p> ePart הינה פלטפורמה אינטרנטית חברתית אשר פותחה ומופעלת על ידי חברת אבשה יזמות חברתית בע”מ (להלן: "<strong>ePart</strong>") ואשר מאפשרת השתתפות פעילה והשפעה על קבלת ההחלטות על ידי הרשות המבצעת, הרשות המחוקקת והרשויות המקומיות בישראל, בדרך של קבלת מידע וסקירות ביחס לנושאים שונים העומדים לדיון, ומתן אפשרות להבעת דעה והבאתה לידיעת מקבלי ההחלטות לשם השפעה ו/או עזרה בקבלת ההחלטות. עשיית שימוש במערכת של ePart תכונה להלן "<strong>השתתפות במיזם</strong>". המשתתפים במיזם יכונו להלן "<strong>משתתפים</strong>". </p> <p> על ידי הכניסה לאתר ו/או ההשתתפות במיזם (כולל צפיה ו/או שימוש בכל התוכן והשירותים הנגישים דרך כתובת האינטרנט www.epart.co.il או בכל אתר ו/או רשת חברתית שיחליף אותו או יתווסף אליו וכן שימוש במידע וסקירות הנשלחות למשתתפים; להלן, בהכללה: "האתר” ו – "התוכן") ו/או ההשתתפות בכל דיון ו/או התכתבות עם אחרים דרך ו/או באמצעות שירות המופעל על ידי האתר ו/או ePart, הינך מאשר ללא כל הסתייגות וללא כל תנאים את הסכמתך המלאה לתנאי השימוש הכלליים הללו (להלן: "תנאי השימוש"). אם אינך מסכים לכל תנאי השימוש, אנא אל תעשה שימוש באתר ו/או בכל שירות ו/או כלי המופעל באמצעות האתר ו/או ePart. תנאי השימוש מתייחסים באופן שווה לבני שני המינים אך מנוסחים בלשון זכר מטעמי נוחות בלבד. </p> <p> האתר ואופן הפעילות של המיזם מצויים בהליכי פיתוח. בהתאם לכך, התוכן של האתר, אופן הפעילות במסגרתו ו/או באמצעותו וההיצע הכללי של ePart עשויים להשתנות בעתיד. ePart אינה מתחייבת לאופן פעילות מסויים או לזמינות של כל מרכיב או תכונה של המערכת של האתר. </p> <div class="divider"></div> <h2>שינוי תנאי השימוש</h2> <p> ePart שומרת לעצמה את הזכות לשנות את תנאי השימוש בכל עת, לפי שיקול דעתה הבלעדי ומסיבה כלשהי וזאת מבלי צורך לתת הודעה מראש על כך, אולם כל שינוי כאמור יחול ממועד ביצוע השינוי ואילך. כל שינוי ו/או תיקון של תנאי השימוש יכנס לתוקף מיד עם פרסום הנוסח המתוקן באתר. הנוסח העדכני האחרון של תנאי השימוש כפי שמפורסם באתר הינו הנוסח היחידי התקף והוא מבטל כל נוסח קודם. השימוש באתר וההשתתפות בפעילות דרך האתר ו/או באמצעים העומדים לרשות המשתמשים על ידי ePart, מהווים הסכמה מראש לכל שינוי ו/או תיקון של תנאי השימוש. משכך, ישנה חשיבות לכך שתקרא את תנאי השימוש בכל כניסה לאתר ו/או לפני כל השתתפות במיזם וזאת על מנת לוודא שהינך מעודכן בנוסח האחרון של תנאי השימוש. </p> <h2>הרשמה לאתר וההשתתפות במיזם</h2> <p> הרישום לאתר וההשתתפות במיזם הינם אסורים במידה והדבר נעשה תוך הפרה ו/או אי-ציות להוראות תנאי השימוש. בהרשמה לאתר וההשתתפות במיזם אתה מצהיר כי: (א) הפרטים שמסרת בעת הרישום לאתר הינם פרטים נכונים מלאים ומדויקים; (ב) נכונות הפרטים שמסרת בעת הרישום לאתר תשמר על ידך לאורך תקופת השימוש שלך באתר; (ג) הינך מחזיק בתא דואר אלקטרוני ברשת האינטרנט אשר פרטיו הינם כפי שמסרת בעת הרישום; (ד) הינך מחזיק בתעודה מזהה תקפה; ו – (ו) השימוש שלך באתר ו/או בשירותים אינו מנוגד לחוק כלשהו. </p> <p> ePart שומרת לעצמה את הזכות לבטל את ההרשמה ואת ההשתתפות במיזם של כל מי שאינו עומד בתנאים האמורים לעיל, וזאת מבלי צורך לתת הסברים או התראה מראש קודם לביטול הרישום כאמור. </p> <p> באם משתמש בחר להירשם ו/או להתחבר לאתר באמצעות חשבון הפייסבוק או חשבון הטוויטר שלו, הוא נותן בכך את הסכמתו לכך שהרשמתו לאתר והשתתפותו במיזם ישותפו באמצעות ו/או דרך חשבון הפייסבוק או הטוויטר שלו (לפי העניין) ולא תהיה לו כל טענה בקשר לכך. </p> <h2>התוכן באתר</h2> <p> התוכן באתר ו/או זה המשותף על ידי ePart עם משתתפים במיזם, לרבות סקירות של נושאים העומדים לדיון וכדומה ("<strong>תוכן של ePart</strong>"), הינם קניינה של ePart והיא שומרת לעצמה את מלוא הזכויות בתוכן זה, לרבות זכויות היוצרים. אין לעשות כל שימוש מסחרי בתוכן של ePart ללא הסכמה מפורשת, מראש ובכתב מ – ePart. אין לשתף תכנים של ePart או לפרסמם כתכנים של ePart באם נערכו בהם שינויים או עריכה כלשהי. </p> <p> בנוסף לאמור, האתר מכיל ו/או יכיל מידע, תוכנה, תמונות, גרפים וחומרים אחרים (כולם יחד: "<strong>תכנים</strong>"), אשר מוגנים ע”י זכויות יוצרים, זכויות מבצעים, סימני מסחר, סודות מסחריים או זכויות קנייניות אחרות. כל התכנים מוגנים בהתאם לדיני זכויות יוצרים ובהתאם לחוק זכויות יוצרים בישראל, ו- ePart הינה בעליהן (או משתמשת מורשית) של זכויות אלו, לרבות בבחירה, עיצוב, תיאום, הסדרה והשבחה של תכנים כאמור. למשתמש אסור לשנות, להסיר, למחוק, להגדיל, ליצור נגזרת עבודה או לנצל בכל דרך שהיא את התכנים, בשלמותם או בחלקם – שלא על פי האפשרויות לשיתוף בדוא”ל וברשתות החברתיות כפי שהן מתאפשרות באתר. </p> <p> עיצוב האתר, הטקסט, הגרפיקות, בחירתם וסידורם, וכל זכויות היוצרים ביחס אליהם, הינם של ePart וכל הזכויות בהם שמורות לePart. </p> <p> אנו מעודדים את המשתתפים להעביר אלינו הצעות ו/או רעיונות לייעול, שיפור ו/או שינוי האופן בו אנחנו פועלים (להלן: "הצעות"). בכל מקרה של העברת הצעות כאמור, ל – ePart תהיה זכות מלאה ורישיון, ללא תמורה, לעשות כל שימוש, לרבות שימוש מסחרי בהצעות אשר יועברו אליה על ידי המשתתפים במיזם וללא כל חבות או התחייבות כלפי מי שנתן את ההצעה. </p> <p> נשמח לקבל מכם תגובות, רעיונות, שאלות ובקשות. אנא כיתבו אלינו <strong>לכתובת הבאה: hello@epart.co.il.</strong> </p> <h2>תוכן ולינקים חיצוניים</h2> <p> ePart עשויה להציג תוכן של צדדים שלישיים ו/או קישורים ("<strong>לינקים</strong>") לאתרים חיצוניים ("<strong>תוכן חיצוני</strong>"). ל-ePart אין כל שליטה על תוכן חיצוני, היא אינה אחראית לו, ותוכן כזה מוצג על ידי ePart רק כשירות למשתמשים באתר. ePart לא תהיה אחראית לכל נזק ישיר או עקיף שייגרם או עלול להיגרם לך כתוצאה משימוש או הסתמכות על תוכן חיצוני. התוכן החיצוני ניתן אך ורק לשם הנוחות של המשתמשים ואין בהכללתו באתר או בכל סקירה הניתנת על ידי ePart משום מצג כלשהו ביחס לתוכן החיצוני, יוצריו או מהימנותו. </p> <h2>אופן ההשתתפות במיזם</h2> <p> <strong> ההשתתפות במיזם מותנית בכך שהמשתתף: (א) ישתמש בשפה מכובדת ומכבדת; (ב) יתנסח לגופו של עניין מתוך כוונה לסייע ולהשפיע לטובה על הדיון הציבורי וקבלת ההחלטות; (ג) לא ינקוט בכל שפה פוגענית, מעליבה, גסה או בוטה; (ד) לא יפרסם לשון הרע על אדם או מוסד כלשהו; (ה) לא יתחזה לאדם אחר ולא יציג עצמו כבעל השכלה ו/או הסמכה ו/או דרגה שאין לו; (ו) לא יגלה מידע אשר הינו חסוי ו/או סודי בהתאם לכל הסכם ו/או דין ו/או מידע שהינו פרטי ושאינו נחלת הכלל; (ז) לא יעבור כל עבירה על חוקי המדינה ו/או הוראות כל רשות או גוף שלטוני, לרבות לפי חוק הגנת הפרטיות, תשמ”א-1981, חוקי הצנזורה וחוקים הנוגעים לפרסומים אסורים. </strong> </p> <p> <strong>בנוסף לאמור, הינך מתחייב ש</strong>לא להעלות, לפרסם, לשלוח במייל או בכל דרך אחרת להעביר תוכן כלשהו שמכיל וירוסים, לתוכנות או לכל קוד מחשב אחר, מסמכים או תוכניות, שתוכנן, עלול להפריע, להרוס או להגביל את השימושיות של כל תוכנת מחשב, חומרה, ציוד או תוכן של כל צד שלישי. </p> <p> <strong> בכל מקרה של אי ציות לאמור לעיל, תהיה ל-ePart הזכות להפסיק את ההשתפות של המשתתף במיזם ו/או לבטל את ההרשמה שלו לאתר, וזאת לפי שיקול דעתה הבלעדי. כל אי ציות לדין יהיה על אחריות המשתתף בלבד. ePart אינה נוטלת כל אחריות על מעשים של המשתתפים ו/או על התוכן של הפניות שלהם אל מקבלי ההחלטות. </strong> </p> <h2>הסכמה לקבלת תקשורת אלקטרונית</h2> <p> בהרשמה לאתר, הנך מסכים לקבל תקשורת אלקטרונית מ-<strong>ePart אשר עשויה לכלול סקירות של נושאים העומדים לדיון, מידע על פעילות ו/או שירותים של ePart וכן פניות ו/או מידע אחר.</strong> הסכמה זו מהווה הסכמה מפורשת ורצונית שלך לקבל את התקשורת וההודעות מ-<strong>ePart</strong> לרבות מסרים המכילים תוכן העונה על ההגדרה "דבר פרסומת”, על פי תיקון 40 לחוק התקשורת (בזק ושידורים), התשמ”ב-1982. </p> <p> הינך רשאי, בכל עת, להודיע ל-ePart על רצונך להסיר את כתובתך מרשימת הדיוור של ePart, ע”י שליחת הודעה מתאימה על כך. במקרה כזה, רישומך לאתר יבוטל ולא תהיה לך אפשרות להמשיך ולהשתתף במיזם. </p> <h2>אחריות ושיפוי</h2> <p> הנך מסכים להיות אחראי אישית ולשפות במלוא גובה הסכום את ePart וכל מי מטעמה, עבור כל נזק ישיר, עקיף ו/או תוצאתי, אשר ייגרמו עקב כל מעשה ו/או מחדל שלך, ללא הגבלה, כאשר נזקים אלו כוללים, ללא הגבלה, כל נזק ישיר עקיף ו/או תוצאתי, כולל, אך לא רק, נזקים שנגרמו מאובדן הכנסה, אובדן רכוש, קנסות, שכר טרחת עורכי-דין ועלויות נוספות, כולל, ללא הגבלה, נזקים שנגרמו כתוצאה מתביעה, תשלום קנסות, הפסדים ו/או צווי מניעה. </p> <h2>הגנה על פרטיות</h2> <p> ePart דואגת לפרטיות של המשתמשים ואינה מעבירה את הפרטים אודות המשתמשים לאחרים. יחד עם זאת, הנך מבין ומסכים כי ePart תעביר את פרטיך וכל מידע אשר יהיה ברשותה על מנת לציית לחוק, בין אם תתבקש לעשות זאת על ידי גוף משפטי או ממשלתי בעל סמכות, ובין אם לפי שיקול דעתה צעד זה נחוץ, על מנת לשמור על החוק. </p> <p> כמו כן, הנך מבין ומסכים כי ePart תעביר את פרטיך וכל מידע אשר יהיה ברשותה, לרבות תוכן, אם צעד זה נדרש: (1) על מנת לאכוף את תנאי השימוש; (2) על מנת להשיב לתביעה משפטית הטוענת כי בוצעה הפרה של זכויות צד שלישי; (3) על מנת להגן על הזכויות, הרכוש והאינטרסים של ePart ו/או עובדיה, משתמשים, מעניקי חסות, שותפים עיסקיים והציבור הכללי; או (4) בכל מחלוקת, דרישה או הליכים משפטיים, ככל שיהיו, בין המשתמש לבין ePart. </p> <h2>הגבלת אחריות</h2> <p> כפי שהובהר לעיל, האתר משמש רק כפלטפורמה המאפשרת למשתמשים לפנות באופן ישיר ובלתי אמצעי אל נבחרי הציבור ומקבלי ההחלטות. ePart אינה נוטלת חלק פעיל בפעילות של המשתתפים במיזם, אינה משתתפת בתוכן פניותיהם ואינה מנהלת מעקב אחר פעילות המשתתפים. בהתאם לכך, ePart אינה אחראית לכל פעולה או מחדל של צדדים שלישיים כלשהם לרבות המשתתפים. </p> <p> ePart עושה מאמץ להבטיח שהסקירות שמסופקות למשתתפים תהיינה מדוייקות ככל האפשר. למרות האמור, ePart אינה מבטיחה שלא תפולנה טעויות עובדתיות או אחרות בסקירות שכאלה, כגון: טעות לעניין מועד קיומו של דיון כלשהו, המשתתף מודע לאפשרות של טעויות כאמור ולא תהיינה לו כל טענה כלפי ePart בגין טעויות אשר יכול ותהיינה בסקירה כלשהי. </p> <p> ePart אינה מתחייבת כי הפעילות והשירות באתר יהיו ללא הפרעות ו/או תקלות. במידה ונתגלתה תקלה בפעילות האתר, על המשתתף להודיע לePart, על מנת שזו תפעל לתיקון התקלה. </p> <p> ePart לא תישא באחריות לפעילות כלשהי אשר אינה בשליטתה המלאה. </p> <p> הנך מסכים ומאשר כי אתה מודע לכך ש- ePart אינה יכולה לאבטח את מערכות המידע והאבטחה בצורה הרמטית מפני מצבים של חדירה בלתי מורשית למערכות המידע ושימוש אסור במידע הרישום. ePart לא תישא באחריות במצבים בהם נעשתה חדירה בלתי מורשית ובוצעו פעולות בלתי חוקיות של אחרים במידע. הנך מסכים ומאשר כי לא תעמוד לך טענה ו/או דרישה כנגד ePart במצב זה. </p> <h2>סמכות שיפוט</h2> <p> תנאי שימוש אלו יפורשו וידונו בהתאם לחוקיה של מדינת ישראל, והנך מסכים ליתן סמכות שיפוט בלעדית למערכת בתי המשפט במחוז תל אביב- יפו, בקשר לכל סכסוך שעשוי להתגלע בינך לבין ePart בכל נושא שהוא. </p> <h2>פניות אל ePart</h2> <p> <strong> בכל עניין הנוגע לשימוש באתר ו/או השתתפות במיזם ו/או לפעולות של משתתפים, ניתן לפנות אל ePart בדואר אלקטרוני לכתובת הבאה: hello@epart.co.il. </strong> </p>

source: <p class="highlighted">ePart is a civic startup which gives you, the citizen, the ability to influence the government on subjects you care about with only one click, from anywhere, anytime. </p><p> ePart makes civic engagement easy and simple – we use technology in order to deepen political participation by enabling citizens to connect continually with their elected representatives - not just once every four years, on election day.</p>
he_il: <p class="highlighted"> ePart הוא סטארט-אפ חברתי, שמחבר את האזרחים ישירות אל הנבחרים שלהם, מקצר את המרחק בין המקום בו הם נמצאים לכנסת ישראל, לרשות המקומית שלהם או לממשלה ונותן להם את היכולת להשפיע. </p> <p> אנחנו פועלים מתוך מטרה חברתית. אנחנו שואפים לחזק את הדמוקרטיה ואת המעורבות האזרחית, אבל אנחנו לא עמותה. אנחנו משתמשים בטכנולוגיה, ופועלים מתוך מודל כלכלי – אבל אנחנו לא עוד סטארט-אפ. אנחנו משהו באמצע. באמריקה קוראים לזה Civic Startup. בעברית זה נשמע יותר טוב. </p> <div class="divider"></div> <h2>מה אנחנו עושים</h2> <p> ePart רואה עצמו כגשר בין היכולת הטכנולוגית הקיימת לבין הצורך החברתי; ePart הופך את המידע לנגיש, ידידותי למשתמש, פתוח ושקוף, מאפשר לאזרח להתעדכן בנושאים שמעניינים אותו – ובהם בלבד – ולהגיב באופן פשוט ומהיר, להשמיע את דעתו, להשתתף, לשתף – ולהשפיע. הוא מקצר את המרחק בין האזרח לבין נבחר הציבור שלו, מציב אותו בתוך משכן הכנסת – אבל מבלי לנסוע לירושלים, בתוך חדרי הוועדות – אבל מבלי להשתעמם מישיבות אינסופיות ומתישות. להשפיע על עתידו – גם בלי להיות חתום על חוקים. התהליך הדמוקרטי כולו יהפוך כך לשוויוני יותר, והדיון הציבורי למעמיק ורציני יותר. קבלת ההחלטות של נבחרי הציבור תתבסס על התמונה המלאה והמקיפה מכולן – חוכמת ההמונים. </p> <h2>למי אנחנו פונים</h2> <p> על ידי דיווח מאוזן ונטול פניות, וממשק טכנולוגי נגיש וישיר, ePart מאפשר למגוון אוכלוסיות רחב, מכל גווני הקשת הישראלית, לקחת חלק בדיון, כדי ליצור קהילה של רעיונות – ולא של מפלגות וקבוצות, ולתת להם כלי יעיל וישיר לפנות אל הנבחרים ולהשפיע על החוקים שחשובים להם, בכל תחום עניין שהוא. כן, הכוונה גם אליך. </p>

source: A general error occurred, please try again
he_il: אירעה שגיאה בשרת, בבקשה נסה שוב

source: About
he_il: אודות

source: About ePart
he_il: קצת על ePart

source: About the team
he_il: הכירו את הצוות

source: About us text
he_il: ePart הוא סטארט-אפ חברתי, שמחבר את האזרחים ישירות אל הנבחרים שלהם, מקצר את המרחק בין המקום בו הם נמצאים לכנסת ישראל, לרשות המקומית שלהם או לממשלה ונותן להם את היכולת להשפיע.

source: Accessibility Menu
he_il: תפריט נגישות

source: Action Items
he_il: החלטות

source: Add
he_il: הוספה

source: Add a Conclusion
he_il: הוספת מסקנה

source: Add a new category
he_il: הוספת נושא חדש

source: Add a new committee
he_il: הוספת ועדה חדשה

source: Add a new Faq
he_il: הוספת שאלה ותשובה

source: Add a new mk
he_il: הוספת ח"כ חדש

source: Add a new post
he_il: הוספת דיון חדש

source: Add a new setting
he_il: הוספת הגדרה חדשה

source: Add a new user
he_il: הוספת משתמש חדש

source: Add a Poll
he_il: הוסף סקר

source: Add New Discussion
he_il: הוספת דיון חדש

source: Add to Calendar
he_il: הוספה ליומן

source: Additional Knesset Members
he_il: צירוף ח"כים נוספים

source: Admin Dashboard
he_il: ניהול מערכת

source: Administrator
he_il: מנהל מערכת

source: Advanced Search
he_il: חיפוש מתקדם

source: All
he_il: הכל

source: All (ePart + Knesset)
he_il: כל הסטטוסים

source: All Statuses
he_il: כל הסטטוסים

source: All Subjects
he_il: כל הנושאים

source: Already a Member?
he_il: כבר נרשמת?

source: Analysis Page
he_il: לניתוח הדיון

source: Answer
he_il: תשובה

source: Are you sure?
he_il: אתה בטוח שברצונך לבצע פעולה זו?

source: Back to Home Screen
he_il: חזרה לעמוד הבית

source: Beer-Sheva
he_il: באר-שבע

source: Browse
he_il: בחר קובץ

source: Browser
he_il: דפדפן

source: By clicking signup you are agreeing to the
he_il: לחיצה על ‘הרשמה’ מהווה הסכמה ל

source: Cancel
he_il: ביטול

source: Categories
he_il: נושאים

source: Change Image
he_il: החלפת תמונה

source: Choose Related Tags
he_il: בחירת תיוגים רלוונטים

source: Citizens are taking a step forward, Sign up and take a sit in the discussion table next to your decision makers.
he_il: דיונים חשובים קורים כאן כרגע ואזרחים רבים לוקחים בהם חלק. שמרנו גם לך מקום ליד שולחן הדיונים. קדימה להשפיע.

source: Collect ideas from citizens
he_il: העלאת רעיונות והצעות המתבססות על הידע והניסיון של המשתתפים

source: Coming Soon
he_il: בקרוב

source: Comment
he_il: תגובה

source: Comment by
he_il: התגובה של

source: Comments
he_il: תגובות

source: Comments Found
he_il: תגובות שנמצאו

source: Comments Upvotes
he_il: לייקים לתגובות

source: Committee Meeting Date
he_il: תאריך ישיבה

source: Committee Meeting Hour
he_il: שעת ישיבה

source: Committees
he_il: ועדות

source: Conclusion Icon
he_il: תמונה:

source: Conclusion Text
he_il: מסקנה חדשה

source: Conclusions and Decisions
he_il: פרסום מסקנות והחלטות

source: Conclusions For Implementation
he_il: מסקנות ליישום

source: Confirm
he_il: אישור

source: Confirm Password
he_il: סיסמה פעם נוספת

source: connect to epart
he_il: התחבר ל ePart

source: Continue
he_il: המשך

source: Could not reset the password, please repeat the process.
he_il: אירעה שגיאה במהלך איפוס הסיסמה, בבקשה נסה שוב.

source: Dashboard
he_il: בית

source: Data was saved successfully.
he_il: השמירה בוצעה בהצלחה.

source: Date
he_il: תאריך

source: Days
he_il: ימים

source: Decision Maker
he_il: מקבל החלטות

source: Decision Makers
he_il: מקבלי החלטות מעורבים בנושא

source: Delete
he_il: מחיקה

source: Deleting this cannot be undone
he_il: לאחר הפעולה לא ניתן יהיה להשיב את המידע.

source: Desktop Notifications
he_il: הודעות בשולחן העבודה

source: Discussion
he_il: דיון

source: Discussion Analysis
he_il: ניהול תגיות דיון

source: Discussion Background
he_il: חומר רקע

source: Discussion Conclusion
he_il: סיכום דיון

source: Discussion Conclusions and Decisions
he_il: מסקנות והחלטות

source: Discussion Management Dashboard
he_il: מערכת ניהול דיונים

source: Discussion Timeline
he_il: תהליך התייעצות

source: Discussions Participation
he_il: דיונים בהם השתתפתי

source: document
he_il: מסמך

source: Draft
he_il: טיוטה

source: Edit
he_il: עריכה

source: Edit category
he_il: עריכת נושא

source: Edit committee
he_il: עריכת ועדה

source: Edit Faq
he_il: עריכת שאלה ותשובה

source: Edit mk
he_il: עריכת ח"כ

source: Edit post
he_il: עריכת דיון

source: Edit setting
he_il: עריכת הגדרה

source: Edit user
he_il: עריכת משתמש

source: education
he_il: החינוך

source: email
he_il: מייל

source: Email
he_il: מייל

source: Email address is incorrect
he_il: כתובת הדוא"ל אינה תקינה

source: Email Notifications
he_il: על מה נודיע לך בהודעה במייל?

source: Email Notifications Settings
he_il: עריכת הגדרות דוא"ל

source: Enter official mk email:
he_il: נא להזין את כתובת המייל הרשמית לצורך איפוס סיסמתך:

source: ePart - FAQ
he_il: ePart - שאלות ותשובות

source: ePart - Learning Tool
he_il: על ePart ככלי לימוד

source: ePart - Terms and Privacy Policy
he_il: ePart - תנאי שימוש ומדיניות פרטיות

source: ePart Edited Posts
he_il: ערוך

source: ePart platform can be used as a learning tool for both teachers and students.
he_il: תלמידים? סטודנטים? מורים לאזרחות? גלו כיצד מערכת ePart יכולה לסייע לכם.

source: Error saving data.
he_il: הפעולה נכשלה, בבקשה נסה שנית.

source: Example: gocwRvLhDf8
he_il: לדוגמא: gocwRvLhDf8

source: Example: Primary school teacher
he_il: דוגמא: מורה בתיכון אילון

source: exit
he_il: יציאה

source: External Discussion
he_il: דיון משתמשים

source: Facebook
he_il: פייסבוק

source: Facebook Image
he_il: תמונת פייסבוק

source: FAQ
he_il: שאלות ותשובות

source: Faqs
he_il: שאלות ותשובות

source: Featured Image
he_il: תמונה לפיד ראשי

source: Field Already Exists
he_il: השדה כבר קיים במערכת

source: Filename
he_il: שם הקובץ

source: Files
he_il: קבצים

source: Fill Your Hometown
he_il: עדכון עיר מגורים

source: First name
he_il: שם פרטי

source: First Name
he_il: שם פרטי

source: follow
he_il: עקוב

source: Follow 3 Subjects
he_il: בחירת 3 נושאים למעקב

source: Followers
he_il: עוקבים

source: following
he_il: עוקב

source: Following
he_il: עוקב/ת

source: Forgot Password?
he_il: שכחת את הסיסמה?

source: Form data is incorrect
he_il: חלק מהשדות בטופס אינם תקינים

source: From
he_il: מתוך

source: From Date
he_il: מתאריך

source: have an account
he_il: כבר נרשמת?

source: Home
he_il: בית

source: Hometown
he_il: מקום מגורים

source: Hours
he_il: שעות

source: I found
he_il: מצאתי

source: ID
he_il: מזהה

source: Image
he_il: תמונה

source: image caption
he_il: צילום

source: Image Caption
he_il: קרדיט תמונה

source: In this step, We will analyze the data and ideas gathered during the public brainstorming
he_il: בשלב זה, אנחנו ננתח את המידע שעלה בסיעור המוחות הציבורי כדי לגבש מסקנות והחלטות

source: Insert new Conclusion
he_il: הוספת מסקנה

source: Insert new message
he_il: הודעה חדשה..

source: Interested!
he_il: חשוב לי!

source: Interested?
he_il: חשוב לך?

source: Internal Discussion
he_il: דיון פנימי

source: Invalid field format
he_il: השדה לא תקין

source: Invalid field value
he_il: השדה לא תקין

source: Invitation Sent
he_il: זימון נשלח

source: Invitation wasn't sent.
he_il: שגיאה בשליחת הזימון, בבקשה נסו שוב.

source: is added to your followers
he_il: הצטרף לעוקבים שלך.

source: Jerusalem
he_il: ירושלים

source: join epart
he_il: הצטרפות ל ePart

source: Join Now
he_il: הצטרפות

source: Join with
he_il: הצטרפות עם

source: join with email
he_il: הצטרף עם אי מייל

source: Join with Facebook
he_il: הצטרפות עם פייסבוק

source: Knesset official title
he_il: כותרת רשמית של הכנסת

source: Knesset Posts
he_il: נמשך מהכנסת

source: Last Month
he_il: חודש

source: Last name
he_il: שם משפחה

source: Last Name
he_il: שם משפחה

source: Last Week
he_il: שבוע

source: Latest Comments
he_il: תגובות מדיונים בוערים

source: Let`s Go!
he_il: קדימה לעבודה!

source: Logging in..
he_il: מתחבר לאתר...

source: Login
he_il: התחברות

source: Login failed, Please try again
he_il: ההתחברות נכשלה, בבקשה נסה שוב

source: login with
he_il: התחברות עם

source: Login with
he_il: התחברות עם

source: login with facebook
he_il: התחברות עם פייסבוק

source: Login with Facebook
he_il: התחברות עם פייסבוק

source: Logout
he_il: התנתקות :(

source: Looking for Something Else?
he_il: לא מצאת את הדיון שחיפשת?

source: Main Image
he_il: תמונה לעמוד דיון

source: Make Your Impact
he_il: הדרך שלך להשפיע על מה שחשוב לך

source: Make your impact on
he_il: הדרך שלך להשפיע על

source: Meeting Cancelled
he_il: הדיון בוטל

source: Meeting Date
he_il: תאריך

source: Men
he_il: גברים

source: Migration Status
he_il: סטטוס עריכה

source: Minutes
he_il: דקות
