Repository: e-part/open-community-app
Catalog: po/*.po
Languages: he_il

source: more posts that interests you
he_il: דיונים נוספים שיעניינו אותך

source: My Subjects
he_il: הנושאים שלי

source: New
he_il: חדש

source: New discussion added to one of your subjects.
he_il: דיון חדש באחד הנושאים שלך.

source: New post published in
he_il: דיון חדש פורסם בנושא

source: New Users
he_il: משתמשים חדשים

source: Nir Zohar – Co founder & Chairman
he_il: ניר זוהר - מייסד ויו״ר הדירקטוריון

source: Nir, the first investor in the company is also chairman of the board, and contributes his vast experience in high tech as the president of WIX.com Ltd.<br/>Nir has been with Wix since 2007 and he’s been the driving force behind the successful scaling of the company's operations from a small start-up into an international company serving tens of millions of users. Nir spearheads all efforts to develop and implement Wix' strategic plans geared towards accommodating the company's growth objectives and business goals.<br/> On his day off you can catch him reading, spending time with his kids or avidly following the NBA scores.
he_il: ניר, המשקיע הראשון בחברה, עוד כשהייתה בגדר רעיון בלבד, עומד בראש הדירקטוריון שלה, ותורם לה מניסיונו העשיר בעולם ההיי-טק, כנשיא ענקית האינטרנט WIX, סיפור הצלחה ישראלי ששוויו מוערך בלמעלה ממיליארד דולר. <br><br> במקביל להיותו נשיא WIX, ניר משמש גם כסמנכ”ל התפעול של החברה. הוא הצטרף אליה ב-2007, ומאז הוביל בהצלחה את תהליך צמיחתה של החברה מסטארט-אפ קטן, לחברת ענק עם עסקים חובקי-עולם, המשרתת עשרות מיליוני משתמשים מכל קצוות הגלובוס. לפני כן, שימש בתפקידים שונים בסוכנות היהודית ובתנועת הצופים. את שירותו הצבאי סיים בדרגת רב-סרן, בוגר קורס חובלים וקצין בספינות הטילים של חיל הים. <br><br> ניר, בן 38, גר בעיר הולדתו תל אביב, עם אשתו ושני ילדיו. את זמנו הוא מעדיף להעביר בקריאה, בילוי עם המשפחה וכמובן צפייה אדוקה במשחקי NBA.

source: Not Registered?
he_il: עדיין לא נרשמת?

source: Occupation
he_il: מקצוע

source: OK
he_il: אישור

source: One of your comments was replied.
he_il: מישהו הגיב על עמדתך.

source: Open Discussion Page
he_il: כניסה לעמוד הדיון

source: or
he_il: או

source: Other
he_il: אחר

source: Our Bot is Here to Help
he_il: בדיוק בשביל זה הבוט שלנו פה.

source: out of
he_il: מתוך

source: Participants
he_il: משתתפים

source: Participate in a Discussion
he_il: השתתפות בדיון

source: Password
he_il: סיסמה

source: Permalink
he_il: סלאג

source: Please approve the registration, E-mail has been sent to your inbox.
he_il: בבקשה אשר/י את ההרשמה, מכתב נשלח לתיבת הדוא"ל שלך.

source: Please Choose a Password:
he_il: בחירת סיסמה:

source: Please make sure you have entered a valid mail.
he_il: לא ניתן להשלים את הפעולה, אנא וודא שכתובת הדוא"ל שהזנת תקינה.

source: Please Sign-in to Continue
he_il: רק שניה... קודם צריך להתחבר :-)

source: Poll Section
he_il: סקר

source: Polls Votes
he_il: הצבעות בסקרים

source: Popular
he_il: פופולריים

source: Popularity
he_il: פופולריות

source: Post Analysis
he_il: ניתוח דיונים

source: Post Offical Title
he_il: כותרת רשמית

source: Post Title
he_il: כותרת דיון

source: Posts
he_il: דיונים

source: posts that might interest you
he_il: דיונים במיוחד בשבילך

source: Preview
he_il: תצוגה מקדימה

source: Previous Discussions
he_il: דיונים שהתקיימו

source: Profile
he_il: הפרופיל שלי

source: Public Brainstorming
he_il: סיעור מוחות

source: Public Data Analysis
he_il: ניתוח מידע

source: Public Discussion Ended
he_il: הדיון התקיים

source: Published
he_il: פורסם

source: Question
he_il: שאלה

source: Register
he_il: הרשמה

source: Related Posts
he_il: תתי דיונים

source: replied on your comment in
he_il: הגיב על עמדתך בדיון

source: Reset
he_il: ביטול

source: Reset password
he_il: איפוס סיסמה

source: Reset Password
he_il: איפוס סיסמה

source: Reset password email was sent
he_il: דוא"ל לאיפוס הסיסמה נשלח לתיבת הדוא"ל שלך.

source: Reset password process complete
he_il: הסיסמה הוחלפה בהצלחה.

source: Reset Settings
he_il: איפוס הגדרות

source: Roles
he_il: סוג

source: Save
he_il: שמור

source: Search Post..
he_il: חפש דיון..

source: Search Tags or Type a New One
he_il: הוסיפו תיוגים

source: Search User (by ID, name or email)
he_il: חיפוש לפי מזהה, שם או מייל

source: Search User..
he_il: חיפוש משתמש..

source: Searching for Specific Discussion?
he_il: רוצה לראות את כל הדיונים הצפויים בוועדות הכנסת?

source: Seconds
he_il: שניות

source: security
he_il: הביטחון

source: see more
he_il: ראה עוד

source: Select a Committee
he_il: בחירת ועדה

source: Select at least 3 subjects you find interesting..
he_il: עכשיו רק נשאר לך לבחור לפחות 3 נושאים שמעניינים אותך...

source: Select Subjects
he_il: בחירת נושאים

source: send
he_il: פרסום תגובה

source: Send
he_il: שלח

source: Send invitation
he_il: שליחת מייל הצטרפות למערכת

source: Sentiments Average
he_il: ממוצע ניתוח רגשות

source: Settings
he_il: הגדרות

source: Share
he_il: שתף

source: Show All Comments
he_il: הצג את כל התגובות

source: Show Cancelled Only
he_il: הצג דיונים שבוטלו

source: Show Stats
he_il: תצוגה

source: Sign in
he_il: התחברות

source: Sign Up
he_il: הצטרפות

source: Signup
he_il: הרשמה

source: Size
he_il: גודל

source: Slug
he_il: סלאג

source: Sort By
he_il: סדר לפי

source: Statistics
he_il: סטטיסטיקות

source: Status
he_il: סטטוס

source: Subjects
he_il: נושאים

source: Subjects Selection
he_il: בחירת נושאים

source: Submit
he_il: שמור

source: Subscritions error message
he_il: המערכת לא הצליחה להשלים את הפעולה, בבקשה נסה שוב.

source: Subscritions success message
he_il: הגדרות הדוא"ל שלך שונו בהצלחה.

source: Subtitle
he_il: כותרת משנה

source: Switch Contrast
he_il: החלפת ניגודיות

source: Switch Font Size
he_il: הגדלת / הקטנת גופן

source: Tel-Aviv
he_il: תל-אביב

source: Terms and Conditions
he_il: תנאי השימוש והפרטיות

source: Terms and Privacy Policy
he_il: תנאי שימוש ופרטיות

source: The Bot
he_il: הבוט

source: the environment
he_il: איכות הסביבה

source: the housing market
he_il: שוק הדיור

source: The products of the public discussion will be presented, and will include the conclusions and the recommendations for action
he_il: התוצרים של תהליך השיתוף יפורסמו, ויכללו סיכום קצר של כל המסקנות שעלו מהדיון הציבורי ואת ההחלטות וההמלצות לפעולה

source: The subject has {{ctrl.followersCount}} followers. Know people who care about {{category.name}}? Let them know.
he_il: הנושא הזה חשוב ל-{{ctrl.followersCount}} משתמשים. יש לך עוד חברים שאכפת להם מ{{category.name}}? שיבואו גם!

source: The Team
he_il: הצוות

source: This post could no be saved:
he_il: השמירה נכשלה:

source: Time to Make a Difference
he_il: הזמן שלך להשפיע

source: Title
he_il: כותרת

source: To Date
he_il: לתאריך

source: to find out more about ePart.
he_il: ונשמח לחזור אליכם עם עוד מידע על ePart.

source: Top Contributing Decision Makers
he_il: מקבלי ההחלטות הפעילים ביותר

source: Top Contributors
he_il: דירוג המשפיעים

source: Top ranked posts
he_il: על מה כולם מדברים?

source: transportation
he_il: הבטיחות בדרכים

source: Try Again
he_il: התחל מהתחלה

source: Tweet
he_il: צייץ

source: Twitter
he_il: טוויטר

source: Uncategorized
he_il: תגיות ללא נושא

source: Underline Links
he_il: הדגשת קישורים

source: Update Comment
he_il: עדכון תגובה

source: update committees
he_il: עדכון ועדות

source: update details
he_il: עדכון פרטים

source: Upload a File
he_il: העלאת קובץ

source: Upload files
he_il: העלאת קבצים

source: Upload Profile Picture
he_il: העלאת תמונת פרופיל

source: User
he_il: משתמש רגיל

source: User details saved.
he_il: הפרטים נשמרו בהצלחה.

source: User Role
he_il: סוג המשתמש

source: User Settings
he_il: הגדרות חשבון

source: User Was Created.
he_il: המשתמש נוצר במערכת.

source: Users
he_il: משתמשים

source: Users Stats
he_il: התפלגות משתתפים

source: View Post
he_il: הצג עמוד דיון

source: Vote in a Poll
he_il: הצבעה בסקר

source: Votes
he_il: הצבעות

source: Welcome mk
he_il: ברוכים הבאים!

source: What Subjects interest you?
he_il: מה מעניין אותך?

source: what you care about
he_il: מה שחשוב לך

source: What`s Your Opinion?
he_il: מה יש לך להגיד על זה?

source: Who we are?
he_il: מי אנחנו?

source: Women
he_il: נשים

source: Write us
he_il: כתבו לנו

source: Yossi Hayut – Co founder & CEO
he_il: יוסי חיות - מייסד ומנכ"ל

source: Yossi is a social entrepreneur and a public interest lawyer. He is the founder and CEO of ePart. <br/>Previously, Yossi founded the clinical legal education program that provides pro-bono assistance to Holocaust survivors at Tel Aviv University’s Faculty of Law. He was also an instructor in the Economic Justice clinic, specializing in social business and microfinance loans for women in poverty, also at Tel Aviv University. Yossi was awarded the "Medal of Light" on behalf of the Foundation for the Benefit of Holocaust Victims and President of Israel, for his unique contribution to Holocaust survivors rights and his involvement in writing the Holocaust Survivors National Assistance Program. He holds an M.A. in public leadership from Tel Aviv University and he lives in near the yarkon park with his wife and daughters, Alona and Galia.
he_il: יוסי הוא יזם חברתי, ועורך דין לשעבר. הוא הקים את ePart מתוך החוויה שלו כעורך דין שמסייע לאוכלוסיות מוחלשות. במהלך פעילותו גילה שהאזרחים יכולים להשפיע ולשנות דרך ועדות הכנסת, ומתוך הרצון שלו להפוך את המעורבות האזרחית לקלה ונגישה לכולם, הקים את הפלטפורמה של ePart. במסגרת תפקידו, יוסי אחראי על הפיכת המוצר מרעיון ומשרבוט על נייר לחוויה שמשרתת אלפי משתמשים מעורבים ומשפיעים בישראל. הוא אחראי על בניית המוצר וניהול פעילות החברה על כל היבטיה. <br><br> בטרם ייסד את ePart, הקים יוסי את הקליניקה המעניקה סיוע משפטי פרו-בונו לקשישים ולניצולי שואה, והנחה סטודנטים בקליניקה ליזמות עסקית ולצדק כלכלי המסייעת לנשים החיות בעוני להקים עסקים זעירים. שתי הקליניקות פעלו בפקולטה למשפטים באוניברסיטת תל אביב. לפני כן עבד יוסי בחינוך הא-פורמלי, כרכז הדרכה ומרכז שבט צופים בהנהגת תל אביב-יפו. <br><br> יוסי, בן 36, גר בתל אביב עם אשתו ועם בנותיו. רצה הגורל והוא אוהד אדוק של הפועל תל אביב, ובשאר זמנו הוא רוכב על סוסים (וטרם ויתר על חלומו להפוך למדריך רכיבה טיפולית), ושומע מוזיקה של אריק איינשטיין.

source: Yotam is the head of our technology team. He joined us a few months ago to help us build our new web platform. Yotam has been a full-stack developer in the last five years, in which he was a team leader in My6sense, a startup in the Ad-Tech industry, and a volunteering developer at Helpi, a startup dedicated to increasing social involvement within the community.<br/>Yotam has Bsc in computer science from the Hebrew University of Jerusalem and a Master`s degree in Philosophy from Tel-Aviv University.
he_il: יותם, מפתח שהצטרף אלינו לפני כמה חודשים, שעובד על פיתוח האתר החדש שלנו, לרבות צד השרת וצד הלקוח. יותם נמצא בתחום כבר למעלה מחמש שנים, ובשנים האחרונות היה ראש צוות בחברת My6Sense, שמפתחת כלים לטובת תעשיית הפרסום באינטרנט. בשנה האחרונה, הוא גם מתנדב בסטארט-אפ חברתי נוסף, שנקרא GetInvolved, ומפתח פלטפורמות שנועדו להקל על אנשים להצטרף לפעילויות התנדבותיות. יותם הוא גם בעל תואר ראשון במדעי המחשב מהאוניברסיטה העברית, והוא בקרוב יסיים את התואר השני בפילוסופיה, באוניברסיטת תל אביב.

source: Yotam Shalev – Full Stack Developer
he_il: יותם שלו - מתכנת

source: You can just drag them in this window!
he_il: (אפשר גם לגרור תמונות אל תוך החלון)

source: You chose
he_il: בחרת

source: You Got Plenty of Options to Make a Change
he_il: יש לך עוד הרבה אפשרויות להשפיע…

source: You have a new follower.
he_il: משתמש חדש החל לעקוב אחריך.

source: Your Checklist
he_il: צ'ק ליסט

source: Your post is safe with us!
he_il: הדיון נשמר בהצלחה.

source: Youtube Video ID
he_il: וידאו מיוטיוב (ID)
